create_clock -period 6.250 -name CLK -waveform {0.000 3.125} [get_ports CLK]
set_input_delay -clock [get_clocks CLK] -min -add_delay 2.000 [get_ports REn]
set_input_delay -clock [get_clocks CLK] -max -add_delay 3.000 [get_ports REn]
set_input_delay -clock [get_clocks CLK] -min -add_delay 2.000 [get_ports RST]
set_input_delay -clock [get_clocks CLK] -max -add_delay 3.000 [get_ports RST]
set_input_delay -clock [get_clocks CLK] -min -add_delay 2.000 [get_ports WEn]
set_input_delay -clock [get_clocks CLK] -max -add_delay 3.000 [get_ports WEn]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports Empty]
set_output_delay -clock [get_clocks CLK] -max -add_delay 1.000 [get_ports Empty]
set_output_delay -clock [get_clocks CLK] -min -add_delay 0.000 [get_ports Full]
set_output_delay -clock [get_clocks CLK] -max -add_delay 1.000 [get_ports Full]
